Pandas library:

Pandas is a powerful Python library for data manipulation and analysis. Below is a list of some of the most commonly used functions and methods in Pandas along with a brief description of their work. Please note that Pandas is a vast library, and this list is not exhaustive, but it covers many essential functions:

Data Structures:
1. `pd.Series(data)`: Create a one-dimensional labeled array (Series) capable of holding various data types.
2. `pd.DataFrame(data)`: Create a two-dimensional labeled data structure with columns that can hold different data types.

In [1]:
# import pandas
import pandas as pd

list1 = ["Nayan", "Marmik", "Dharm"]

# make serial data structure
s = pd.Series(list1)
s

0     Nayan
1    Marmik
2     Dharm
dtype: object

In [2]:
# Valid dictionary formate for making DataFrame
dict = {
    "Name": ["Nayan"],
    "email":["nayantest123@gmail.com"],
    "phone number:":["9876543210"]
}

# Below dictionary formate in invalid.
# dict = {
#     "Name": "Nayan",
#     "email":"nayantest123@gmail.com",
#     "phone number:":"9876543210"
# }

df = pd.DataFrame(dict)
df

    Name                   email phone number:
0  Nayan  nayantest123@gmail.com    9876543210

In [3]:
datas = {
    "Name": ["Nayan", "Jignesh", "Rudra", "Om"],
    "Roll_Num": [12, 14, 15, 16],
    "Email": ["Nayan123@gmail.com", "Jignesh123@gmail.com", "Rudra123@gmail.com", "Om123@gmail.com"],
}

df = pd.DataFrame(datas)
df

      Name  Roll_Num                 Email
0    Nayan        12    Nayan123@gmail.com
1  Jignesh        14  Jignesh123@gmail.com
2    Rudra        15    Rudra123@gmail.com
3       Om        16       Om123@gmail.com

Reading and Writing Data:
3. `pd.read_csv()`: Read data from a CSV file into a DataFrame.
4. `pd.read_excel()`: Read data from an Excel file into a DataFrame.
5. `df.to_csv()`: Write a DataFrame to a CSV file.
6. `df.to_excel()`: Write a DataFrame to an Excel file.

In [4]:
# create csv dile
mydata = {
    "Name": ["Nayan", "Jignesh", "Rudra", "Om"],
    "Roll_Num": [12, 14, 15, 16],
    "Email": ["Nayan123@gmail.com", "Jignesh123@gmail.com", "Rudra123@gmail.com", "Om123@gmail.com"],
}

df = pd.DataFrame(mydata)
df

# create csv file
df.to_csv("csvfile.csv")
df.to_csv("withoutindexcsvfile.csv", index=False) # By default it is true

In [5]:
# read csv file
df = pd.read_csv("csvfile.csv")
df

   Unnamed: 0     Name  Roll_Num                 Email
0           0    Nayan        12    Nayan123@gmail.com
1           1  Jignesh        14  Jignesh123@gmail.com
2           2    Rudra        15    Rudra123@gmail.com
3           3       Om        16       Om123@gmail.com

In [9]:
# read excel file
import pip
# pip.main(["install", "openpyxl"])
df = pd.read_excel("excelfile.xlsx")
print(df)

   index   subjects       Date
0      1      Maths 2023-04-12
1      2    Physics 2023-05-18
2      3  Chemistry 2023-05-22
3      4      Hindi 2023-05-23
4      5   Gujarati 2023-06-14

In [12]:
# create excel file

bills = {
    "Products": ["NoteBook", "Pen", "Sharpner", "Campasbox"],
    "Price":[40,5,5,60]
}

df = pd.DataFrame(bills)

# with index (By default)
df.to_excel("bills.xlsx")

In [13]:
# without index
df.to_excel("bills1.xlsx", index=False)

Data Exploration:
df.head(): Display the first n rows of a DataFrame.
df.tail(): Display the last n rows of a DataFrame.
df.shape: Return the dimensions of the DataFrame (rows, columns).
df.info(): Display information about the DataFrame, including data types and missing values.
df.describe(): Generate summary statistics of numeric columns.
df.columns: Access column names.
df.dtypes: Return data types of each column.
df.value_counts(): Count unique values in a column.
df.isna(): Check for missing values.
df.dropna(): Remove rows or columns with missing values.

In [14]:
# df.head(): Display the first n rows of a DataFrame.
df.head(2)

   Products  Price
0  NoteBook     40
1       Pen      5

In [15]:
# df.tail(): Display the last n rows of a DataFrame.
df.tail(3)

    Products  Price
1        Pen      5
2   Sharpner      5
3  Campasbox     60

In [16]:
# df.info(): Display information about the DataFrame, including data types and missing values.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Products  4 non-null      object
 1   Price     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [17]:
# df.describe(): Generate summary statistics of numeric columns.
df.describe()

           Price
count   4.000000
mean   27.500000
std    27.233558
min     5.000000
25%     5.000000
50%    22.500000
75%    45.000000
max    60.000000

In [32]:
# df.columns: Access column names.
# df.columns(["Price"]) # TypeError: 'Index' object is not callable

df = pd.read_excel("bills1.xlsx")
df.columns

Index(['Products', 'Price'], dtype='object')

In [52]:
# df.dtypes: Return data types of each column.
d = {
    "subjects" : ["Gujarati", "Maths", "Hindi", "Science", "Maths"],
    "marks" : [78, 99, 87, 99, 99]
}

df = pd.DataFrame(d)
df.dtypes

subjects    object
marks        int64
dtype: object

In [51]:
# df.value_counts(): Count unique values in a column.

df.value_counts()

subjects  marks
Maths     99       2
Gujarati  78       1
Hindi     87       1
Science   99       1
Name: count, dtype: int64

In [55]:
# df.isna(): Check for missing values.


df = pd.read_csv("cd.csv")

df.isna()

    city  distancefromcapital
0  False                False
1  False                 True
2  False                 True
3  False                False
4   True                False
5  False                False

In [57]:
# df.dropna(): Remove rows or columns with missing values.
df.dropna()

         city  distancefromcapital
0       Anjar                 33.0
3        Bhuj                 56.0
5  Gandhidham                  6.0

Data Selection and Indexing:
df.iloc[]: Select data by integer-based indexing.
df.loc[]: Select data by label-based indexing.
df[column_name] or df.column_name: Select a single column.
df[['col1', 'col2']]: Select multiple columns.
df.iloc[:, start_col:end_col]: Select a range of columns.
df[df['column'] > value]: Filter rows based on a condition.
df.sort_values(): Sort the DataFrame by column(s).

In [58]:
# df.iloc[]: Select data by integer-based indexing.
df.iloc[0]

city                   Anjar
distancefromcapital     33.0
Name: 0, dtype: object

In [61]:
df.iloc[[0,2]]

       city  distancefromcapital
0     Anjar                 33.0
2  Bhachayu                  NaN

In [62]:
df.iloc[[1,2,0]]

       city  distancefromcapital
1  Adipur21                  NaN
2  Bhachayu                  NaN
0     Anjar                 33.0

In [65]:
# df.loc[]: Select data by label-based indexing.
df.index = ['c1', 'c2', 'c3', 'c4', 'c5', 'c6']
df.loc['c1']

city                   Anjar
distancefromcapital     33.0
Name: c1, dtype: object

In [68]:
df.loc[["c1", "c3"]]

        city  distancefromcapital
c1     Anjar                 33.0
c3  Bhachayu                  NaN

In [70]:
df.loc[["c6", "c5"]]

          city  distancefromcapital
c6  Gandhidham                  6.0
c5         NaN                 44.0

In [71]:
# df[column_name] or df.column_name: Select a single column.
df['city']

c1         Anjar
c2      Adipur21
c3      Bhachayu
c4          Bhuj
c5           NaN
c6    Gandhidham
Name: city, dtype: object

In [72]:
df.city

c1         Anjar
c2      Adipur21
c3      Bhachayu
c4          Bhuj
c5           NaN
c6    Gandhidham
Name: city, dtype: object

In [73]:
# df[['col1', 'col2']]: Select multiple columns.

df[["city", "distancefromcapital"]]

          city  distancefromcapital
c1       Anjar                 33.0
c2    Adipur21                  NaN
c3    Bhachayu                  NaN
c4        Bhuj                 56.0
c5         NaN                 44.0
c6  Gandhidham                  6.0

In [74]:
df[["distancefromcapital", "city"]]

    distancefromcapital        city
c1                 33.0       Anjar
c2                  NaN    Adipur21
c3                  NaN    Bhachayu
c4                 56.0        Bhuj
c5                 44.0         NaN
c6                  6.0  Gandhidham

In [82]:
# df.iloc[:, start_col:end_col]: Select a range of columns.
df.iloc[:, 0:1]

          city
c1       Anjar
c2    Adipur21
c3    Bhachayu
c4        Bhuj
c5         NaN
c6  Gandhidham

In [83]:
df.loc[:, "city":"distancefromcapital"]

          city  distancefromcapital
c1       Anjar                 33.0
c2    Adipur21                  NaN
c3    Bhachayu                  NaN
c4        Bhuj                 56.0
c5         NaN                 44.0
c6  Gandhidham                  6.0

In [84]:
# df[df['column'] > value]: Filter rows based on a condition.
df[df["distancefromcapital"]>40]

    city  distancefromcapital
c4  Bhuj                 56.0
c5   NaN                 44.0

In [85]:
df[df["distancefromcapital"]<50]

          city  distancefromcapital
c1       Anjar                 33.0
c5         NaN                 44.0
c6  Gandhidham                  6.0

In [87]:
# df.sort_values(): Sort the DataFrame by column(s).

df.sort_values("distancefromcapital")

          city  distancefromcapital
c6  Gandhidham                  6.0
c1       Anjar                 33.0
c5         NaN                 44.0
c4        Bhuj                 56.0
c2    Adipur21                  NaN
c3    Bhachayu                  NaN

In [88]:
df.sort_values("city")

          city  distancefromcapital
c2    Adipur21                  NaN
c1       Anjar                 33.0
c3    Bhachayu                  NaN
c4        Bhuj                 56.0
c6  Gandhidham                  6.0
c5         NaN                 44.0

Data Cleaning and Transformation:
df.rename(): Rename columns.
df.drop(): Drop specified labels from rows or columns.
df.fillna(): Fill missing values.
df.replace(): Replace values.
df.groupby(): Group data by one or more columns.
df.pivot_table(): Create a pivot table.
df.melt(): Unpivot/melt the DataFrame.
df.apply(): Apply a function to each element or row/column.
df.merge(): Merge two DataFrames.
df.join(): Join DataFrames based on their indexes.

In [100]:
# df.rename(): Rename columns.
df.rename(columns={"city":"City_"})

         City_  distancefromcapital
c1       Anjar                 33.0
c2    Adipur21                  NaN
c3    Bhachayu                  NaN
c4        Bhuj                 56.0
c5         NaN                 44.0
c6  Gandhidham                  6.0

In [101]:
df.rename(columns={"city":"City_"}, inplace=True)

         City_  distancefromcapital
c1       Anjar                 33.0
c2    Adipur21                  NaN
c3    Bhachayu                  NaN
c4        Bhuj                 56.0
c5         NaN                 44.0
c6  Gandhidham                  6.0

In [102]:
df

         City_  distancefromcapital
c1       Anjar                 33.0
c2    Adipur21                  NaN
c3    Bhachayu                  NaN
c4        Bhuj                 56.0
c5         NaN                 44.0
c6  Gandhidham                  6.0

In [105]:
# df.drop(): Drop specified labels from rows or columns.
df.drop(["distancefromcapital"], axis=1) # axis = 1 for column

         City_
c1       Anjar
c2    Adipur21
c3    Bhachayu
c4        Bhuj
c5         NaN
c6  Gandhidham

In [107]:
df.drop(["c3"], axis=0) # axis = 0 for row

         City_  distancefromcapital
c1       Anjar                 33.0
c2    Adipur21                  NaN
c4        Bhuj                 56.0
c5         NaN                 44.0
c6  Gandhidham                  6.0

In [110]:
# df.fillna(): Fill missing values.
df.fillna("NOT AVALIABLE DATA")

                 City_ distancefromcapital
c1               Anjar                33.0
c2            Adipur21  NOT AVALIABLE DATA
c3            Bhachayu  NOT AVALIABLE DATA
c4                Bhuj                56.0
c5  NOT AVALIABLE DATA                44.0
c6          Gandhidham                 6.0

In [111]:
# df.replace(): Replace values.
df.replace("Adipur21", "Adipur")

         City_  distancefromcapital
c1       Anjar                 33.0
c2      Adipur                  NaN
c3    Bhachayu                  NaN
c4        Bhuj                 56.0
c5         NaN                 44.0
c6  Gandhidham                  6.0

In [118]:
# df.groupby(): Group data by one or more columns.
a = pd.read_csv("untitled.csv")
g = a.groupby(["Duration", "Calories"])
g.mean

In [122]:
# chat gpt

import pandas as pd

# Create a sample DataFrame
data = {
    'Category': ['A', 'B', 'A', 'B', 'A'],
    'Value1': [10, 20, 15, 25, 30],
    'Value2': [100, 200, 150, 250, 300]
}

df = pd.DataFrame(data)

# Group the DataFrame by the 'Category' column
grouped = df.groupby('Category')

# Addres 
print(grouped)

# Calculate the mean of each group
means = grouped.mean()

print(means)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E7CD499880>
             Value1      Value2
Category
A         18.333333  183.333333
B         22.500000  225.000000

In [125]:
# df.pivot_table(): Create a pivot table.
# required to read/learn referances
# chat gpt

# Create a sample DataFrame
data = {
    'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02', '2023-01-03'],
    'Category': ['A', 'B', 'A', 'B', 'A'],
    'Value': [10, 20, 15, 25, 30]
}

df = pd.DataFrame(data)
print(df)
# Create a pivot table to summarize the data
pivot_table = df.pivot_table(values='Value', index='Date', columns='Category', aggfunc='sum')

print(pivot_table)

         Date Category  Value
0  2023-01-01        A     10
1  2023-01-01        B     20
2  2023-01-02        A     15
3  2023-01-02        B     25
4  2023-01-03        A     30
Category       A     B
Date
2023-01-01  10.0  20.0
2023-01-02  15.0  25.0
2023-01-03  30.0   NaN

In [ ]:
# df.melt(): Unpivot/melt the DataFrame.

In [3]:
# df.apply(): Apply a function to each element or row/column.

import pandas as pd
data = {
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
}

def doubleTimes(x):
    return x * 2

df = pd.DataFrame(data)
a = df.apply(doubleTimes)
print(a)

    A    B     C
0   2   20   200
1   4   40   400
2   6   60   600
3   8   80   800
4  10  100  1000

In [1]:
# df.merge(): Merge two DataFrames.
# df.join(): Join DataFrames based on their indexes.